---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MajorSpacing
source: html/4c9b24f5-1b3d-830f-16e5-5428000840d6.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MajorSpacing Property

The spacing between the wires in the major direction (not including the overhangs).

## Syntax (C#)
```csharp
public double MajorSpacing { get; }
```